import{n as e}from"./rolldown-runtime-DkW27tQK.js";import{n as t,r as n}from"./lib-BRDOWE9X.js";import{t as r}from"./jsx-runtime-DeHZSEgm.js";function i(e){let t={h2:`h2`,li:`li`,p:`p`,strong:`strong`,ul:`ul`,...n(),...e.components};return(0,o.jsxs)(o.Fragment,{children:[(0,o.jsx)(t.h2,{id:`описание`,children:`Описание`}),`
`,(0,o.jsx)(t.p,{children:`Компонент оповещения (алерт), предназначенный для отображения контекстных сообщений, баннеров или уведомлений.`}),`
`,(0,o.jsx)(t.p,{children:`Компонент Alert является гибко настраиваемым и поддерживает ведущую иконку, заголовок (label), текстовое описание (description), встроенные ссылки (AlertLink) и кнопки действий (actions). Его можно сделать закрываемым, добавив кнопку закрытия, которая запускает плавный переход анимации исчезновения.`}),`
`,(0,o.jsx)(t.p,{children:(0,o.jsx)(t.strong,{children:`Основные возможности:`})}),`
`,(0,o.jsxs)(t.ul,{children:[`
`,(0,o.jsx)(t.li,{children:`Структурированный макет содержимого (ведущая иконка, область контекста с заголовком и описанием, правая кнопка действия или закрытия)`}),`
`,(0,o.jsx)(t.li,{children:`Пользовательские кнопки действий (список actions) и встроенные ссылки (alertLink)`}),`
`,(0,o.jsx)(t.li,{children:`Состояние закрытия с триггерами событий окончания анимации`}),`
`,(0,o.jsx)(t.li,{children:`Гибкое выравнивание макета с возможностью вертикального центрирования`}),`
`]}),`
`,(0,o.jsx)(t.p,{children:(0,o.jsx)(t.strong,{children:`Типичные сценарии использования:`})}),`
`,(0,o.jsxs)(t.ul,{children:[`
`,(0,o.jsx)(t.li,{children:`Встроенные баннеры статуса (например, сообщения об успехе, ошибке, предупреждении или информационные уведомления)`}),`
`,(0,o.jsx)(t.li,{children:`Уведомления на уровне страницы или рекламные оповещения`}),`
`,(0,o.jsx)(t.li,{children:`Карточки с призывом к действию с возможностью быстрого выполнения операций`}),`
`]})]})}function a(e={}){let{wrapper:t}={...n(),...e.components};return t?(0,o.jsx)(t,{...e,children:(0,o.jsx)(i,{...e})}):i(e)}var o;function s(){return(s=e((()=>{o=r(),t()})))()}s();export{a as default};